<!DOCTYPE html>
<html class="no-js" ng-app="CoBi.Session">
	<head>
        <title>Anonym im Internet surfen mit saferWeb Proxy</title>
	    <meta http-equiv="language" content="DE" />
    </head>
	<body >
		<h1>Willkomen auf der saferWeb Hilfeseite</h1>

        <p>saferWeb ist ein Anonymisierungsproxy, der Nutzer vor der Preisgabe sensibler Informationen sch&uuml;tzen soll.</p>

    <h2>Funktionalit&auml;ten im &uuml;berblick:</h2>
<ul style="list-style-type:square;">
        <li>Nur sichere Verbindungen zwischen den Kommunikationspartnern</li>
        <li>Client Anfragen auf personenbezogene Daten &uuml;berpr&uuml;fen und gegebenenfalls Anfragen erst nach Best&auml;tigung weiterleiteten.</li>
        <li>Client-Daten (wie IP Adressen oder Browserinformationen) sollen so weit wie m&ouml;glich anonymisiert werden.</li>
        <li>Websessions sollen vom Proxy-Server aus aufgebaut und f&uuml;r den Client verwaltet werden.</li>
        <li>Tracking soll nach M&ouml;glichkeit erkannt und verhindert werden.</li>
        <li>Datenschutzgef&auml;hrdende Technologien aus Antworten gefiltert werden oder eine Warnung an den Nutzer ausgegeben werden.</li>
        <li>Ein verschl&uuml;sseltes globales Log soll Auskunft &uuml;ber die Aktivit&auml;ten des Proxy geben.</li>
</ul>
    </br>
    <h2>1. Installation:</h2>
        <p>Um einen m&ouml;glichst hohgen Schutz zu gew&auml;hrleisten, ist es n&ouml;tig, den Proxy-Server fachgerecht einzurichten.</p>
  </br>
            <h3>1.1 Browser Einstellungen</h3>

<p>Der Firefox-Browser bringt bereits eigene
Sicherheitseinstellungen mit, jedoch sind diese in den Standardeinstellungen
meist ein Kompromiss zwischen der Sicherheit des Benutzers und einer
komfortableren Benutzbarkeit des Browsers. Ein Beispiel hierf&uuml;r ist die Speicherung von Login
Informationen und die automatische Anmeldung.</p>

<p> Hier die von uns empfohlenen Firefox
Sicherheitseinstellungen:</p>

<p class=MsoNormal><span style='mso-fareast-language:DE;mso-no-proof:yes'><v:shape
 id="Grafik_x0020_13" o:spid="_x0000_i1035" type="#_x0000_t75" style='width:447pt;
 height:210.75pt;visibility:visible;mso-wrap-style:square'>
 <img src="image017.png" o:title=""/>
</v:shape></span></p>

<p> Firefox bietet auch eine Reihe an Einstellungen zur Wahrung
der Privatsph&auml;re.Hervorzuheben ist hier, dass die Browser-History nicht
gespeichert werden sollte, sowie die Aktivierung der Do Not Track
Funktionalit&auml;t.</p>

<p>Generell sollten beim Surfen nur Private Browserfenster vom
Benutzer verwendet werden. Leider haben wir keine Einstellungsm&ouml;glichkeit zur
standardm&auml;&szlig;igen Verwendung von privaten Browserfenstern im Firefox gefunden,
sodass dies vom Benutzer beim Surfen ber&uuml;cksichtigt werden muss.
</p>

<p>Hier die von uns empfohlenen Firefox Privatsph&auml;re
Einstellungen:</p>

<p class=MsoNormal><span style='mso-fareast-language:DE;mso-no-proof:yes'><v:shape
 id="Grafik_x0020_14" o:spid="_x0000_i1034" type="#_x0000_t75" style='width:453.75pt;
 height:276pt;visibility:visible;mso-wrap-style:square'>
 <img src="image018.png" o:title=""/>
</v:shape></span></p>

            </br>
     <h3>1.2 Proxy einrichten</h3>

<p>Um den Client-Browser durch die implementierten Funktionen
des Proxy-Servers zu sch&uuml;tzen, muss dieser Proxy-Server zun&auml;chst in den
Browser-Einstellungen eingerichtet werden. Dazu stellt man die Proxy-Settings
in den Netzwerk-Einstellungen des Browsers auf &quot;Manuelle
Proxy-Konfiguration&quot; und tr&auml;gt die jeweilige Proxy-Adresse ein. Fortan
sendet der Browser seine Anfragen an den eingestellten Proxy-Server. Im
Folgenden Screenshot erkennt man eine beispielhafte Proxy-Konfiguration, die
f&uuml;r einen Firefox-Browser eingerichtet wurde.</p>

<p class=MsoNormal><o:p>&nbsp;</o:p></p>

<p class=MsoNormal><span style='mso-fareast-language:DE;mso-no-proof:yes'><v:shape
 id="Grafik_x0020_19" o:spid="_x0000_i1030" type="#_x0000_t75" style='width:453.75pt;
 height:432.75pt;visibility:visible;mso-wrap-style:square'>
 <img src="image023.png" o:title=""/>
</v:shape></span><br clear=all style='mso-special-character:line-break;
page-break-before:always'>
</p>

                    </br>
     <h3>1.3 Trust Store einrichten</h3>


<p>Stellt ein
Webbrowser eine Verbindung zu einer Website &uuml;ber eine gesicherte Verbindung her
(HTTPS), wird ein SSL-Zertifikat ben&ouml;tigt. Dieses Zertifikat ist ein digitaler
Datensatz, der bestimmte Eigenschaften von Personen oder Objekten best&auml;tigt und
dessen </span><a href="https://de.wikipedia.org/wiki/Authentizit%C3%A4t"><span
style='mso-ascii-font-family:Calibri;mso-fareast-font-family:Calibri;
mso-hansi-font-family:Calibri;mso-bidi-font-family:Calibri;color:windowtext;
text-decoration:none;text-underline:none'>Authentizit&auml;t</span></a><span
style='mso-ascii-font-family:Calibri;mso-fareast-font-family:Calibri;
mso-hansi-font-family:Calibri;mso-bidi-font-family:Calibri'> und </span><a
href="https://de.wikipedia.org/wiki/Integrit%C3%A4t_%28Informationssicherheit%29"><span
style='mso-ascii-font-family:Calibri;mso-fareast-font-family:Calibri;
mso-hansi-font-family:Calibri;mso-bidi-font-family:Calibri;color:windowtext;
text-decoration:none;text-underline:none'>Integrit&auml;t</span></a><span
style='mso-ascii-font-family:Calibri;mso-fareast-font-family:Calibri;
mso-hansi-font-family:Calibri;mso-bidi-font-family:Calibri'> durch
kryptografische Verfahren pr&uuml;ft. Dieses Verfahren ist vergleichbar mit dem
Versiegeln eines Briefs vor dem Versenden. Durch diese vertrauensw&uuml;rdige
Best&auml;tigung kann der Browser der Verbindung trauen. Jeder Browser hat bereits
die weitl&auml;ufig bekannten und vertrauensw&uuml;rdigen Zertifizierungsstellen (CA's)
installiert, bei denen sich Webseiten-Betreiber Zertifikate f&uuml;r
vertrauensw&uuml;rdige Webserver ausstellen lassen k&ouml;nnen.</span></p>

<p>Ein SSL-Zertifikat identifiziert jeweils eine bestimmte Domain (wie etwa google.de)
und einen Webserver. Der Browser pr&uuml;ft dabei genau, f&uuml;r welche Domain ein
Zertifikat ausgestellt wurde. Sendet der Browser nun Anfragen an den
Proxy-Server, erwartet er ein Zertifikat, welches von einer ihm bekannten CA
f&uuml;r genau diesen Webserver ausgestellt wurde. Eine Weiterleitung des
Zertifikates der eigentlich &uuml;ber den Proxy-Server aufgerufenen Zieladresse
reicht hier nicht aus. Da uns kein vertrauensw&uuml;rdiges Zertifikat f&uuml;r unseren
Proxy-Server zur Verf&uuml;gung steht, umgehen wir dieses Problem und erweitern den
Browser durch eine eigene Zertifizierungsstelle, die unseren Proxy-Server
absegnet.</p>

<p>Dazu wird beim Aufruf einer bestimmten Adresse auf dem Proxy-Server ein selbst
generiertes CA-Zertifikat an den Browser &uuml;bergeben. Dieses wird nach
Best&auml;tigung des Nutzers im Browser als neue CA installiert und segnet
zuk&uuml;nftige HTTPS Verbindungen zum Proxy-Server ab.</span></p>
                <p><a href="http://saferWeb.trust">Hier den saferWeb Trust einrichten</a></p>

<p>Folgender Screenshot zeigt die ben&ouml;tigte Best&auml;tigung des Benutzers zur Installation der
neuen Zertifizierungsstelle:</span></p>

<p class=MsoNormal><span style='mso-fareast-language:DE;mso-no-proof:yes'><v:shape
 id="picture" o:spid="_x0000_i1029" type="#_x0000_t75" style='width:417pt;
 height:212.25pt;visibility:visible;mso-wrap-style:square'>
 <img src="image024.png" o:title=""/>
</v:shape></span></p>

<p>Anstelle einer Warnung f&uuml;r eine nicht vertrauensw&uuml;rdige
Verbindung, kann man nun erkennen, dass der Browser der Verbindung traut:</p>


 <img src="image025.png" o:title=""/>
</v:shape></span></p>

<p>F&uuml;r jede aufgerufene Zieldomain wird nun ein eigenes
Zertifikat ben&ouml;tigt, welches f&uuml;r den Proxy-Server ausgestellt ist. Der
Fingerprint der Zertifikate bleibt dabei immer der gleiche. Lediglich der
Common Name (CN) wird f&uuml;r jede aufgerufene Zieldomain ge&auml;ndert. Folgender
Screenshot zeigt die Browseransicht eines generierten Beispielzertifikats.</p>
 <img src="image008.png" o:title="saferWebTrust-google-cert"/>
</v:shape></span></p>

    </br>
     <h3>1.4 Webbrowser Plugins</h3>


<p>Um die Benutzer beim Surfen im Internet vor bekannten
Angriffen wie XSS/ CSRF, Clickjacking, usw. zu sch&uuml;tzen, empfehlen
wir einige Plugins zu installiert und konfiguriert. Zum Schutz vor Schadsoftware kann beispielsweise Fireclam installiert werden.</p>

 <img src="image019.png" o:title=""/>
</v:shape><o:p>&nbsp;</o:p></p>

<br style='mso-ignore:vglayout' clear=ALL>

<p class=MsoNormal>Weitere von uns empfohlene Plugins:</p>
        <ul style="list-style-type:square;">
                <li>Fireclam</li>
                <li>Adblock Plus</li>
                <li>Clickjacking Reveal</li>
                <li>Adblock Plus Popup-Addon</li>
                <li>NoScript</li>
                <li>Self-Destructing Cookies</li>
        </ul>


<p>Einige Plugins ben&ouml;tigen eine detailliertere Konfiguration
um den bestm&ouml;glichen Schutz der Anonymit&auml;t des Benutzers zu erm&ouml;glichen.
</p>

<p>Hier unsere Empfehlung f&uuml;r die Konfiguration von NoScript
zur Blockierung von Java Script:</p>


 <img src="image020.png" o:title=""/>
</v:shape></span></p>

    </br>
<p class=MsoNormal>Hier die Konfiguration von Self-Destructing Cookies:</p>


<p class=MsoNormal><span style='mso-fareast-language:DE;mso-no-proof:yes'><v:shape
 id="Grafik_x0020_17" o:spid="_x0000_i1032" type="#_x0000_t75" style='width:177pt;
 height:220.5pt;visibility:visible;mso-wrap-style:square'>
 <img src="image021.png" o:title=""/>
</v:shape><v:shape id="Grafik_x0020_46" o:spid="_x0000_i1031" type="#_x0000_t75"
 style='width:168.75pt;height:153.75pt;visibility:visible;mso-wrap-style:square'>
 <img src="image022.png" o:title=""/>
</v:shape></span><br clear=all style='mso-special-character:line-break;
page-break-before:always'>
</p>

  </br>
        <h2>Wichtige Links</h2>
        <p><a href="https://de.wikipedia.org/wiki/Proxy_(Rechnernetz)">Was ist ein Proxy-Server</a></p>
        <p><a href="http://saferWeb.trust">Hier den saferWeb Trust einrichten</a></p>
        <p><a href="https://www.torproject.org/projects/torbrowser.html.en">Weitergehende Informationen zur Anonymisierung im Web (Tor-Projekt)</a></p>




	</body>
</html>